src/cf/DataProcessors/TelegramAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>TelegramAPI</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ИдентификаторыПоследнихОбновлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыПоследнихОбновлений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БотыТелеграм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/TelegramAPI/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаСервере
Процедура УстановитьВебхукНаСервере()
	Ответ = Телеграм.setWebhook(Бот, WebhookURL);
	ОтветСервера = СтрШаблон("%1%2%3", Ответ.КодСостояния, Символы.ПС, КоннекторHTTP.КакТекст(Ответ));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВебхук(Команда)
	УстановитьВебхукНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИнформацияОБотеНаСервере()
	Ответ = Телеграм.getMe(Бот);
	ОтветСервера = СтрШаблон("%1%2%3", Ответ.КодСостояния, Символы.ПС, КоннекторHTTP.КакТекст(Ответ));
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОБоте(Команда)
	ИнформацияОБотеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИнформацияОВебхукахНаСервере()
	Ответ = Телеграм.getWebhookInfo(Бот);
	ОтветСервера = СтрШаблон("%1%2%3", Ответ.КодСостояния, Символы.ПС, КоннекторHTTP.КакТекст(Ответ));
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОВебхуках(Команда)
	ИнформацияОВебхукахНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьОбновленияНаСервере()
	Идентификатор = РегистрыСведений.ИдентификаторыПоследнихОбновлений.ПоследнийИдентификатор(Бот);
	Если Идентификатор <> Неопределено Тогда
		Идентификатор = Идентификатор + 1;
	КонецЕсли;
	
	Попытка
		Ответ = Телеграм.getUpdates(Бот, Идентификатор);
	Исключение
		Ответ = КоннекторHTTP.НовыйОтвет();
		Ответ.Тело = Base64Значение(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Если Ответ.КодСостояния = 200 Тогда
		ПараметрыПреобразования = Новый Структура;
		ПараметрыПреобразования.Вставить("ПрочитатьВСоответствие", Ложь);
		
		ТелоОтвета = КоннекторHTTP.КакJson(Ответ, ПараметрыПреобразования);
		
		НовыйИдентификатор = Неопределено;
		Для Каждого update Из ТелоОтвета.result Цикл
			НовыйИдентификатор = update.update_id;
		КонецЦикла;
		
		Если НовыйИдентификатор <> Неопределено Тогда
			РегистрыСведений.ИдентификаторыПоследнихОбновлений.ОбновитьПоследнийИдентификатор(Бот, НовыйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	ОтветСервера = СтрШаблон("%1%2%3", Ответ.КодСостояния, Символы.ПС, КоннекторHTTP.КакТекст(Ответ));
	ОбщегоНазначенияHTTP.ЗаписатьЛогДляОтветаВнешнегоСервиса("botAPI/getUpdates", Ответ);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОбновления(Команда)
	ПолучитьОбновленияНаСервере();
КонецПроцедуры

#КонецОбласти
